In [ ]:
create a dataframe and drop missing values all and by columns

In [4]:
import pandas as pd 
import numpy as np

In [6]:
df=pd.DataFrame([[0,1,2,3],
                  [None,5,None,pd.NaT],
                  [8,None,10,None],
                  [11,12,13,pd.NaT]],columns=list('ABCD'))
df

      A     B     C     D
0   0.0   1.0   2.0     3
1   NaN   5.0   NaN   NaT
2   8.0   NaN  10.0  None
3  11.0  12.0  13.0   NaT

In [7]:
df.dropna()

     A    B    C  D
0  0.0  1.0  2.0  3

In [8]:
df.dropna(subset=["C"])

      A     B     C     D
0   0.0   1.0   2.0     3
2   8.0   NaN  10.0  None
3  11.0  12.0  13.0   NaT

In [11]:
df.dropna(subset=["B","C"])

      A     B     C    D
0   0.0   1.0   2.0    3
3  11.0  12.0  13.0  NaT